bit-finance/DataProcessors/бит_ЗагрузкаДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаДанныхИзТабличногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьНовыхЭлементов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхТабличногоДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеПередЗаписью</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеПриЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеПослеДобавленияСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВидаРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаОбъекта</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещатьСуществующиеЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистраСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПланаСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерииДляРучнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьТабличныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьРегистр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗаполнения</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыЗагруженные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗагрузки</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоНовый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанныйОбъект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/Enums/бит_РежимыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеАналитики</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_РежимыПоискаОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыПоискаОбъекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Искать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устанавливать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вычислять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СохраненныеНастройки</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Comment>Тип настройки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСохраненныхНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Comment>Ключ объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Comment>Настраиваемый объект</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Comment>Ключ настройки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/DataProcessors/бит_ЗагрузкаДанныхИзТабличногоДокумента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

// Процедура конвертирует сохраненные настройки пользователей 
// для обработки бит_рлс_НастройкаПравДоступаНаУровнеЗаписей_Построитель
//
Процедура КонвертироватьНастройки() Экспорт	
	
	ТипРежимаПоиска = Новый ОписаниеТипов("ПеречислениеСсылка.бит_РежимыПоискаОбъекта");
	МетаданныеОбъекта = Метаданные.Справочники.бит_СохраненныеНастройки;
	ЕстьОшибки = Ложь;
	
	//----------------------------------------------------------------------
	// Выбор сохраненных настроек
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", "Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_СохраненныеНастройки.Ссылка,
	|	бит_СохраненныеНастройки.НастраиваемыйОбъект,
	|	бит_СохраненныеНастройки.ХранилищеНастроек
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК бит_СохраненныеНастройки
	|ГДЕ
	|	бит_СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|	И бит_СохраненныеНастройки.ПометкаУдаления = ЛОЖЬ
	|";
	Результат = Запрос.Выполнить();	
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
				
		СтруктураНастроек = Выборка.ХранилищеНастроек.Получить();
		Если СтруктураНастроек = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		 		
		СпрСсылка = Выборка.Ссылка;	
		
		НачатьТранзакцию();
		Попытка
	
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.бит_СохраненныеНастройки");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СпрСсылка);
			Блокировка.Заблокировать();
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
	
			ЕстьИзменения = Ложь;
			НастройкиРеквизитов = СтруктураНастроек.ТаблицаРеквизитов.Получить();
		
			// Конвертация режима загрузки.
			Если ТипЗнч(СтруктураНастроек.РежимЗагрузки) <> Тип("ПеречислениеСсылка.бит_РежимыЗагрузки") Тогда
				Если СтруктураНастроек.РежимЗагрузки = "Справочник" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.Справочник;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "РегистрСведений" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.РегистрСведений;	
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "ТабличнаяЧасть" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.ТабличнаяЧасть;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "РучнаяОперация" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.РучнаяОперация;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "ПланСчетов" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.ПланСчетов;
				КонецЕсли;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			// Конвертация режима поиска в таблице реквизитов.		
			Если НастройкиРеквизитов.Колонки.Найти("РежимЗагрузки") <> Неопределено Тогда			
				НастройкиРеквизитов.Колонки.Добавить("РежимПоиска", ТипРежимаПоиска);
				Для каждого НастройкаРеквизитов Из НастройкиРеквизитов Цикл
					Если НастройкаРеквизитов.РежимЗагрузки = "Искать" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Искать;
					ИначеЕсли НастройкаРеквизитов.РежимЗагрузки = "Устанавливать" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Устанавливать;	
					ИначеЕсли НастройкаРеквизитов.РежимЗагрузки = "Вычислять" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Вычислять;
					КонецЕсли;
				КонецЦикла;
				НастройкиРеквизитов.Колонки.Удалить("РежимЗагрузки");
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			// Поля поиска для документов.
			Для каждого НастройкаРеквизитов Из НастройкиРеквизитов Цикл
				Если НастройкаРеквизитов.ИскатьПо = "Номер" ИЛИ НастройкаРеквизитов.ИскатьПо = "Дата" Тогда
					НастройкаРеквизитов.ИскатьПо = "НомерДата";
					ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЦикла;
			
			// Запись.
			Если ЕстьИзменения Тогда			
				СтруктураНастроек.ТаблицаРеквизитов = Новый ХранилищеЗначения(НастройкиРеквизитов, Новый СжатиеДанных(9));
				СпрОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);							
			КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось записать настройку: %1 по причине: %2';
								  |en = 'Failed to write setting: %1 due to: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СпрСсылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			СобытиеЖурналаРегистрации = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение,
									 МетаданныеОбъекта, , ТекстСообщения);
			ЕстьОшибки = Истина;
			Продолжить;
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры // КонвертироватьНастройки()

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЦветТекстаЯчейкиТабличногоДокумента(ТабличныйДокументФормы) Экспорт
	
	Возврат ТабличныйДокументФормы.Область(1,1,1,1).ЦветТекста;
	
КонецФункции

// Функция получает значение реквизита объекта по имени объекта.
// 
// Параметры:
//  ТекущийОбъект - ДокументОбъект, СправочникОбъект.
//  ИмяРеквизита  - Строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ПолучитьЗначениеРеквизитаОбъекта(ТекущийОбъект, ИмяРеквизита) Экспорт
	
	ЗначениеРеквизита = Неопределено;	
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаданныеОбъекта) Тогда		
		ЗначениеРеквизита = ТекущийОбъект[ИмяРеквизита];		
	КонецЕсли; 	
	
	Возврат ЗначениеРеквизита;

КонецФункции // ПолучитьЗначениеРеквизитаОбъекта()

#КонецОбласти

#КонецЕсли
